docs/example_ovi.txt

POST /epa/xds-document/api/I_Document_Management HTTP/1.1
accept: */*
x-insurantid: X110467329
content-type: multipart/related; type="application/xop+xml"; boundary="uuid:d045f2a5-0a7c-4f51-8824-bdb27031b41e"; start="<root.message@cxf.apache.org>"; start-info="application/soap+xml; action=\"urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b\""
user-agent: Apache-CXF/4.0.5
host: epa-as-2.dev.epa4all.de
x-useragent: Oviva/0.0.1
content-length: 10323


--uuid:d045f2a5-0a7c-4f51-8824-bdb27031b41e
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml; action=\"urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b\""
Content-Transfer-Encoding: binary
Content-ID: <root.message@cxf.apache.org>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><ns5:ProvideAndRegisterDocumentSetRequest xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns4="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns5="urn:ihe:iti:xds-b:2007" xmlns:ns6="urn:ihe:iti:rmd:2017"><ns4:SubmitObjectsRequest><RegistryObjectList><RegistryPackage objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage" id="dd498c34-ff95-4d40-885f-c019fb96535a"><Slot name="submissionTime"><ValueList><Value>20241213125718</Value></ValueList></Slot><Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="dd498c34-ff95-4d40-885f-c019fb96535a" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="c0c4f7b5-f02e-4300-b2fc-0ff95a467619"><Slot name="authorPerson"><ValueList><Value>1234^^^^^^^^&amp;1.2.276.0.76.4.16&amp;ISO</Value></ValueList></Slot><Slot name="authorInstitution"><ValueList><Value>Oviva^^^^^&amp;1.2.276.0.76.4.188&amp;ISO^^^^1-SMC-B-Testkarte-883110000141746</Value></ValueList></Slot></Classification><Classification classifiedObject="dd498c34-ff95-4d40-885f-c019fb96535a" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="157efa8f-c9d0-4214-b4dd-9f0641a35954"/><ExternalIdentifier registryObject="dd498c34-ff95-4d40-885f-c019fb96535a" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" value="X110467329^^^&amp;1.2.276.0.76.4.8&amp;ISO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="298d6db9-ae82-4f4d-9a84-765de4b9740c"><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="XDSSubmissionSet.patientId"/></Name></ExternalIdentifier><ExternalIdentifier registryObject="dd498c34-ff95-4d40-885f-c019fb96535a" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" value="2.25.176058894201924258912" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="0b23beb0-459e-4184-bff8-c375ebe69872"><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="XDSSubmissionSet.uniqueId"/></Name></ExternalIdentifier></RegistryPackage><ExtrinsicObject mimeType="text/plain" isOpaque="false" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" id="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788"><Slot name="creationTime"><ValueList><Value>20241213095718</Value></ValueList></Slot><Slot name="languageCode"><ValueList><Value>de-DE</Value></ValueList></Slot><Slot name="URI"><ValueList><Value>Oviva_DiGA_Export_2024-12-13T12:57:18.505179</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="ePA Export Oviva Direkt for Obesity 2024-12-13T12:57:18.505179"/></Name><Description><LocalizedString xml:lang="de-DE" charset="UTF-8" value="DiGA MIO-Beispiel eines Dokument von Referenzimplementierung geschickt (Simple Roundtrip)"/></Description><Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" nodeRepresentation="DUR" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="0a18a1ef-1094-4af1-b662-bc1d855e994e"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.8</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="Durchführungsprotokoll"/></Name></Classification><Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" nodeRepresentation="N" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="c667f92f-0a21-4e64-a16c-fb9bb24d4a75"><Slot name="codingScheme"><ValueList><Value>2.16.840.1.113883.5.25</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="normal"/></Name></Classification><Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" nodeRepresentation="E400" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="1dbf4a38-9e18-4026-ae74-6c575de2191b"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.16</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="Virtual Encounter"/></Name></Classification><Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" nodeRepresentation="H1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="c27172d7-faee-4382-ac03-84d8605b700e"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.15</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="vom Patienten mitgebracht"/></Name></Classification><Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" nodeRepresentation="urn:gematik:ig:diga:v1.1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="e07e7b76-0007-4758-b807-878d48699c30"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.6</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="DiGA (gematik) v1.1"/></Name></Classification><Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" nodeRepresentation="PAT" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="0960f216-66dd-4d6f-ace8-ceb2ead086e0"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.3</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="Patient außerhalb der Betreuung"/></Name></Classification><Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" nodeRepresentation="PAT" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="2d4ba083-719f-4e2d-a27a-0a2e45e85826"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.5</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="Patient außerhalb der Betreuung"/></Name></Classification><Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" nodeRepresentation="PATD" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="9cf6901c-db1d-469a-94e3-2eb59b2f31e3"><Slot name="codingScheme"><ValueList><Value>1.3.6.1.4.1.19376.3.276.1.5.9</Value></ValueList></Slot><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="Patienteneigene Dokumente"/></Name></Classification><Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="0e19ab52-0169-4ffc-9137-ce7cfa65efb1"><Slot name="authorPerson"><ValueList><Value>1-SMC-B-Testkarte-883110000141746^Oviva Direkt für Adipositas^Oviva AG^^^^^^&amp;1.2.276.0.76.4.282&amp;ISO</Value></ValueList></Slot><Slot name="authorRole"><ValueList><Value>12^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.13&amp;ISO</Value></ValueList></Slot><Slot name="authorInstitution"><ValueList><Value>Oviva^^^^^&amp;1.2.276.0.76.4.188&amp;ISO^^^^1-SMC-B-Testkarte-883110000141746</Value></ValueList></Slot><Slot name="authorSpecialty"><ValueList><Value>25^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.11&amp;ISO</Value></ValueList></Slot><Slot name="authorTelecommunication"><ValueList><Value>^^Internet^telematik-infrastructure@oviva.com</Value></ValueList></Slot></Classification><ExternalIdentifier registryObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" value="X110467329^^^&amp;1.2.276.0.76.4.8&amp;ISO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="bb433e5a-2882-4c9d-8d3c-4f0aa1e294ee"><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="XDSDocumentEntry.patientId"/></Name></ExternalIdentifier><ExternalIdentifier registryObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" value="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="63dd47d6-2097-47d0-9c6e-503bb12c0c3b"><Name><LocalizedString xml:lang="de-DE" charset="UTF-8" value="XDSDocumentEntry.uniqueId"/></Name></ExternalIdentifier></ExtrinsicObject><Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" sourceObject="dd498c34-ff95-4d40-885f-c019fb96535a" targetObject="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788" id="0f2a498a-5ecb-438e-884c-7547fb9f7c75"/></RegistryObjectList></ns4:SubmitObjectsRequest><ns5:Document id="urn:uuid:7be19f0a-175f-4757-8184-690fd1c1f788"><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:ba89f90c-47ed-46a7-bc0b-544cb65e2b6d-1@urn%3Aihe%3Aiti%3Axds-b%3A2007"/></ns5:Document></ns5:ProvideAndRegisterDocumentSetRequest></soap:Body></soap:Envelope>
--uuid:d045f2a5-0a7c-4f51-8824-bdb27031b41e
Content-Type: application/octet-stream
Content-Transfer-Encoding: binary
Content-ID: <ba89f90c-47ed-46a7-bc0b-544cb65e2b6d-1@urn:ihe:iti:xds-b:2007>

Hallo Welt
--uuid:d045f2a5-0a7c-4f51-8824-bdb27031b41e--